{
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "dtype": "float32",
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-INVOICE_NO",
    "2": "I-INVOICE_NO",
    "3": "B-INVOICE_DATE",
    "4": "I-INVOICE_DATE",
    "5": "B-VENDOR_NAME",
    "6": "I-VENDOR_NAME",
    "7": "B-VENDOR_GSTIN",
    "8": "I-VENDOR_GSTIN",
    "9": "B-BUYER_NAME",
    "10": "I-BUYER_NAME",
    "11": "B-BUYER_GSTIN",
    "12": "I-BUYER_GSTIN",
    "13": "B-VENDOR_ADDRESS",
    "14": "I-VENDOR_ADDRESS",
    "15": "B-BUYER_ADDRESS",
    "16": "I-BUYER_ADDRESS",
    "17": "B-TAXABLE_AMOUNT",
    "18": "I-TAXABLE_AMOUNT",
    "19": "B-CGST_AMOUNT",
    "20": "I-CGST_AMOUNT",
    "21": "B-SGST_AMOUNT",
    "22": "I-SGST_AMOUNT",
    "23": "B-IGST_AMOUNT",
    "24": "I-IGST_AMOUNT",
    "25": "B-TOTAL_AMOUNT",
    "26": "I-TOTAL_AMOUNT",
    "27": "B-DUE_DATE",
    "28": "I-DUE_DATE",
    "29": "B-PO_NUMBER",
    "30": "I-PO_NUMBER",
    "31": "B-BILL_NO",
    "32": "I-BILL_NO",
    "33": "B-BILL_DATE",
    "34": "I-BILL_DATE",
    "35": "B-SUBTOTAL",
    "36": "I-SUBTOTAL",
    "37": "B-TAX_AMOUNT",
    "38": "I-TAX_AMOUNT",
    "39": "B-PAYMENT_TERMS",
    "40": "I-PAYMENT_TERMS",
    "41": "B-RECEIPT_NO",
    "42": "I-RECEIPT_NO",
    "43": "B-RECEIPT_DATE",
    "44": "I-RECEIPT_DATE",
    "45": "B-AMOUNT",
    "46": "I-AMOUNT",
    "47": "B-PAYMENT_MODE",
    "48": "I-PAYMENT_MODE",
    "49": "B-CATEGORY",
    "50": "I-CATEGORY",
    "51": "B-CONSUMER_NO",
    "52": "I-CONSUMER_NO",
    "53": "B-BILLING_PERIOD",
    "54": "I-BILLING_PERIOD",
    "55": "B-UNITS_CONSUMED",
    "56": "I-UNITS_CONSUMED",
    "57": "B-AMOUNT_DUE",
    "58": "I-AMOUNT_DUE",
    "59": "B-UTILITY_PROVIDER",
    "60": "I-UTILITY_PROVIDER",
    "61": "B-ACCOUNT_NAME",
    "62": "I-ACCOUNT_NAME",
    "63": "B-CREDIT_NOTE_NO",
    "64": "I-CREDIT_NOTE_NO",
    "65": "B-CREDIT_NOTE_DATE",
    "66": "I-CREDIT_NOTE_DATE",
    "67": "B-ORIGINAL_INVOICE_NO",
    "68": "I-ORIGINAL_INVOICE_NO",
    "69": "B-REASON",
    "70": "I-REASON",
    "71": "B-CREDIT_AMOUNT",
    "72": "I-CREDIT_AMOUNT",
    "73": "B-TAX_CREDIT",
    "74": "I-TAX_CREDIT",
    "75": "B-DEBIT_NOTE_NO",
    "76": "I-DEBIT_NOTE_NO",
    "77": "B-DEBIT_NOTE_DATE",
    "78": "I-DEBIT_NOTE_DATE",
    "79": "B-DEBIT_AMOUNT",
    "80": "I-DEBIT_AMOUNT"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACCOUNT_NAME": 61,
    "B-AMOUNT": 45,
    "B-AMOUNT_DUE": 57,
    "B-BILLING_PERIOD": 53,
    "B-BILL_DATE": 33,
    "B-BILL_NO": 31,
    "B-BUYER_ADDRESS": 15,
    "B-BUYER_GSTIN": 11,
    "B-BUYER_NAME": 9,
    "B-CATEGORY": 49,
    "B-CGST_AMOUNT": 19,
    "B-CONSUMER_NO": 51,
    "B-CREDIT_AMOUNT": 71,
    "B-CREDIT_NOTE_DATE": 65,
    "B-CREDIT_NOTE_NO": 63,
    "B-DEBIT_AMOUNT": 79,
    "B-DEBIT_NOTE_DATE": 77,
    "B-DEBIT_NOTE_NO": 75,
    "B-DUE_DATE": 27,
    "B-IGST_AMOUNT": 23,
    "B-INVOICE_DATE": 3,
    "B-INVOICE_NO": 1,
    "B-ORIGINAL_INVOICE_NO": 67,
    "B-PAYMENT_MODE": 47,
    "B-PAYMENT_TERMS": 39,
    "B-PO_NUMBER": 29,
    "B-REASON": 69,
    "B-RECEIPT_DATE": 43,
    "B-RECEIPT_NO": 41,
    "B-SGST_AMOUNT": 21,
    "B-SUBTOTAL": 35,
    "B-TAXABLE_AMOUNT": 17,
    "B-TAX_AMOUNT": 37,
    "B-TAX_CREDIT": 73,
    "B-TOTAL_AMOUNT": 25,
    "B-UNITS_CONSUMED": 55,
    "B-UTILITY_PROVIDER": 59,
    "B-VENDOR_ADDRESS": 13,
    "B-VENDOR_GSTIN": 7,
    "B-VENDOR_NAME": 5,
    "I-ACCOUNT_NAME": 62,
    "I-AMOUNT": 46,
    "I-AMOUNT_DUE": 58,
    "I-BILLING_PERIOD": 54,
    "I-BILL_DATE": 34,
    "I-BILL_NO": 32,
    "I-BUYER_ADDRESS": 16,
    "I-BUYER_GSTIN": 12,
    "I-BUYER_NAME": 10,
    "I-CATEGORY": 50,
    "I-CGST_AMOUNT": 20,
    "I-CONSUMER_NO": 52,
    "I-CREDIT_AMOUNT": 72,
    "I-CREDIT_NOTE_DATE": 66,
    "I-CREDIT_NOTE_NO": 64,
    "I-DEBIT_AMOUNT": 80,
    "I-DEBIT_NOTE_DATE": 78,
    "I-DEBIT_NOTE_NO": 76,
    "I-DUE_DATE": 28,
    "I-IGST_AMOUNT": 24,
    "I-INVOICE_DATE": 4,
    "I-INVOICE_NO": 2,
    "I-ORIGINAL_INVOICE_NO": 68,
    "I-PAYMENT_MODE": 48,
    "I-PAYMENT_TERMS": 40,
    "I-PO_NUMBER": 30,
    "I-REASON": 70,
    "I-RECEIPT_DATE": 44,
    "I-RECEIPT_NO": 42,
    "I-SGST_AMOUNT": 22,
    "I-SUBTOTAL": 36,
    "I-TAXABLE_AMOUNT": 18,
    "I-TAX_AMOUNT": 38,
    "I-TAX_CREDIT": 74,
    "I-TOTAL_AMOUNT": 26,
    "I-UNITS_CONSUMED": 56,
    "I-UTILITY_PROVIDER": 60,
    "I-VENDOR_ADDRESS": 14,
    "I-VENDOR_GSTIN": 8,
    "I-VENDOR_NAME": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "transformers_version": "5.6.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "visual_embed": true,
  "vocab_size": 50265
}
